PayPalAPISoapBinding.DoAuthorization.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:DoAuthorizationReq>
    <ns1:DoAuthorizationRequest>
     <ns1:TransactionID></ns1:TransactionID>
     <ns1:TransactionEntity>None</ns1:TransactionEntity>
     <ns1:Amount currencyID="AFA"></ns1:Amount>
     <ns3:ShipToAddress>
      <ns3:Name></ns3:Name>
      <ns3:Street1></ns3:Street1>
      <ns3:Street2></ns3:Street2>
      <ns3:CityName></ns3:CityName>
      <ns3:StateOrProvince></ns3:StateOrProvince>
      <ns3:Country>AF</ns3:Country>
      <ns3:CountryName></ns3:CountryName>
      <ns3:Phone></ns3:Phone>
      <ns3:PostalCode></ns3:PostalCode>
      <ns3:AddressID></ns3:AddressID>
      <ns3:AddressOwner>PayPal</ns3:AddressOwner>
      <ns3:ExternalAddressID></ns3:ExternalAddressID>
      <ns3:InternationalName></ns3:InternationalName>
      <ns3:InternationalStateAndCity></ns3:InternationalStateAndCity>
      <ns3:InternationalStreet></ns3:InternationalStreet>
      <ns3:AddressStatus>None</ns3:AddressStatus>
      <ns3:AddressNormalizationStatus>None</ns3:AddressNormalizationStatus>
     </ns3:ShipToAddress>
     <ns3:PaymentDetailsItem>
      <ns3:Name></ns3:Name>
      <ns3:Number></ns3:Number>
      <ns3:Quantity>0</ns3:Quantity>
      <ns3:Tax currencyID="AFA"></ns3:Tax>
      <ns3:Amount currencyID="AFA"></ns3:Amount>
      <ns3:EbayItemPaymentDetailsItem>
       <ns3:ItemNumber></ns3:ItemNumber>
       <ns3:AuctionTransactionId></ns3:AuctionTransactionId>
       <ns3:OrderId></ns3:OrderId>
       <ns3:CartID></ns3:CartID>
      </ns3:EbayItemPaymentDetailsItem>
      <ns3:PromoCode></ns3:PromoCode>
      <ns3:ProductCategory>Other</ns3:ProductCategory>
      <ns3:Description></ns3:Description>
      <ns3:ItemWeight unit="">0.0</ns3:ItemWeight>
      <ns3:ItemLength unit="">0.0</ns3:ItemLength>
      <ns3:ItemWidth unit="">0.0</ns3:ItemWidth>
      <ns3:ItemHeight unit="">0.0</ns3:ItemHeight>
      <ns3:ItemURL></ns3:ItemURL>
      <ns3:EnhancedItemData>
      </ns3:EnhancedItemData>
      <ns3:ItemCategory>Physical</ns3:ItemCategory>
     </ns3:PaymentDetailsItem>
     <ns3:PaymentDetailsItem>
      <ns3:Name></ns3:Name>
      <ns3:Number></ns3:Number>
      <ns3:Quantity>0</ns3:Quantity>
      <ns3:Tax currencyID="AFA"></ns3:Tax>
      <ns3:Amount currencyID="AFA"></ns3:Amount>
      <ns3:EbayItemPaymentDetailsItem>
       <ns3:ItemNumber></ns3:ItemNumber>
       <ns3:AuctionTransactionId></ns3:AuctionTransactionId>
       <ns3:OrderId></ns3:OrderId>
       <ns3:CartID></ns3:CartID>
      </ns3:EbayItemPaymentDetailsItem>
      <ns3:PromoCode></ns3:PromoCode>
      <ns3:ProductCategory>Other</ns3:ProductCategory>
      <ns3:Description></ns3:Description>
      <ns3:ItemWeight unit="">0.0</ns3:ItemWeight>
      <ns3:ItemLength unit="">0.0</ns3:ItemLength>
      <ns3:ItemWidth unit="">0.0</ns3:ItemWidth>
      <ns3:ItemHeight unit="">0.0</ns3:ItemHeight>
      <ns3:ItemURL></ns3:ItemURL>
      <ns3:EnhancedItemData>
      </ns3:EnhancedItemData>
      <ns3:ItemCategory>Physical</ns3:ItemCategory>
     </ns3:PaymentDetailsItem>
     <ns1:ItemTotal currencyID="AFA"></ns1:ItemTotal>
     <ns1:ShippingTotal currencyID="AFA"></ns1:ShippingTotal>
     <ns1:HandlingTotal currencyID="AFA"></ns1:HandlingTotal>
     <ns1:TaxTotal currencyID="AFA"></ns1:TaxTotal>
     <ns1:InsuranceTotal currencyID="AFA"></ns1:InsuranceTotal>
     <ns1:ShippingDiscount currencyID="AFA"></ns1:ShippingDiscount>
     <ns1:OrderDescription></ns1:OrderDescription>
     <ns1:Custom></ns1:Custom>
     <ns1:MsgSubID></ns1:MsgSubID>
     <ns1:IPAddress></ns1:IPAddress>
     <ns1:ShipToStore></ns1:ShipToStore>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:DoAuthorizationRequest>
   </ns1:DoAuthorizationReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
